[
    {
        "id": "other-project-mybudget-website",
        "title": "myBudget - Expense widget promo website",
        "year": "Feb 2022 - Mar 2022",
        "github": "https://github.com/KyrXtz/MyBudget-Site",
        "site":"http://mybudget.ddns.net/",
        "app": "",
        "tags": ["VueJs", "Javascript", "Css", "NPM"],
        "description": "This site was made as landing page for myBudget - Expense widget app. It contains the privacy policy required by google play. What originally was a simple static page with the policy only quickly evolved to a robust site with a playful attitude, in order to promote downloading the app, with the power of VueJs.",
        "image": "/assets/other-projects/mbw.webp",
        "jpg": "/assets/other-projects/mbw.jpeg"

    },
    {
        "id": "other-project-fastcal",
        "title": "FastCal (Calorie and Macro Tracker)",
        "year": "Sep 2019 - Feb 2020",
        "github": "https://github.com/KyrXtz/FastCal",
        "app": "https://play.google.com/store/apps/details?id=com.KyrXtz.FastCal",
        "tags": ["C#", "Xamarin", "Cross Platform", "MVVM", "Rest API", "Json"],
        "description": "A simple app to track calories and macros, that eliminated much of the hassle of similar food logging apps by allowing the user to create custom buttons, that represented meals (combinations of food). Thus, the user need only set his meals once, and afterwards the logging is as simple as the press of a button. The food info is retrieved per user request, from the FoodData Central API (the one that Google uses). Sadly, Xamarin fell out of favor from Microsoft in the latest years which meant drops in performance and expandability, so the app hasn't been maintained since.",
        "image": "/assets/other-projects/fastcal.webp",
        "jpg": "/assets/other-projects/fastcal.jpeg"
    },
    {
        "id": "other-project-i-am-bored",
        "title": "I-am-bored",
        "year": "Mar 2020 - Aug 2020",
        "github": "https://github.com/KyrXtz/I-am-bored",
        "app": "https://play.google.com/store/apps/details?id=com.kyrxtz.i.am.bored",
        "tags": ["React native", "Expo","Javascript","Cross platform", "Android", "iOS", "Rest API", "Json"],
        "description": "A joke app, made as a personal introduction to react native and android development that unknowingly had a massive appeal to users, boasting 10 thousand downloads even in its open beta stage with zero marketing. It featured a single red button, that when pressed returned a random article from wikipedia for the user to read when bored. Later funcionality was added to return random videos from youtube and random music from spotify. Due to the chaotic structure of the code (it being an introductory app) the app couldn't be scaled accordingly to meet the high user demand, without recreating from scratch, so the project had to be ultimately dropped.",
        "image": "/assets/other-projects/iambored.webp",
        "jpg": "/assets/other-projects/iambored.jpeg"
    }
]
